#### Terraform Plan ��
```hcl
Acquiring state lock. This may take a few moments...
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.permissions_policy: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-lab-cluster/cluster][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ec11c85650351f76][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296][0m
[0m[1mmodule.eks.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799][0m
[0m[1mmodule.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mdata.aws_iam_policy_document.permissions_policy: Read complete after 0s [id=3488776268][0m
[0m[1mmodule.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250727093456422900000002][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role.this[0]: Refreshing state... [id=spot_nodes-eks-node-group-20250727093456423200000003][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.custom[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117][0m
[0m[1mmodule.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-20250727093456421300000001][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_caller_identity.current: Read complete after 1s [id=022239501643][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=022239501643][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250727093456422900000002-20250727093456967300000005][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-lab-cluster-cluster-20250727093456422900000002-20250727093456999900000006][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-lab-cluster-cluster-20250727093456422900000002-20250727093456926800000004][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=spot_nodes-eks-node-group-20250727093456423200000003-20250727093457014000000007][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=spot_nodes-eks-node-group-20250727093456423200000003-20250727093457032000000008][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=spot_nodes-eks-node-group-20250727093456423200000003-20250727093457063600000009][0m
[0m[1mmodule.eks.data.aws_caller_identity.current[0]: Read complete after 1s [id=022239501643][0m
[0m[1mmodule.eks.data.aws_iam_session_context.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci][0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3478354637][0m
[0m[1mmodule.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=8fef6523-2d30-4bc8-bc0d-77d7c7ab076f][0m
[0m[1mmodule.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-lab-cluster][0m
[0m[1mmodule.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-ClusterEncryption2025072709351924710000000d][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250727093456422900000002-2025072709351959680000000e][0m
[0m[1mmodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0634a43fb835dc4e6][0m
[0m[1mmodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07e7b8f34285c75d7][0m
[0m[1mmodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0120aec2e1dfc0952][0m
[0m[1mmodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0351dfd2f69c0a53e][0m
[0m[1mmodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08e69893509d1edfd][0m
[0m[1mmodule.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bc23716a1c9a8ee3][0m
[0m[1mmodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a3745fe2d9921340][0m
[0m[1mmodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0966dace3268d4bf2][0m
[0m[1mmodule.eks.aws_security_group.node[0]: Refreshing state... [id=sg-03391e85922f86016][0m
[0m[1mmodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0966dace3268d4bf21080289494][0m
[0m[1mmodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0907cca71ce2ddadf][0m
[0m[1mmodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-049b7a01ffb6dcd62][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1828165713][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2678917255][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-453679035][0m
[0m[1mmodule.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-380797911][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2141955184][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3446881003][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2780168135][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3436805822][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3572934670][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1753668945][0m
[0m[1mmodule.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1564216884][0m
[0m[1mmodule.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-lab-cluster][0m
[0m[1mmodule.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci][0m
[0m[1mmodule.eks.time_sleep.this[0]: Refreshing state... [id=2025-07-27T09:41:55Z][0m
[0m[1mmodule.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0a400ed12ef82b769,Project][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["coredns"]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...[0m[0m
[0m[1mmodule.eks.data.tls_certificate.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=4202659414780930087][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_launch_template.this[0]: Refreshing state... [id=lt-0c512cdc1ae8d97a7][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-lab-cluster:spot_nodes-20250727094202668600000011][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni][0m
[0m[1mmodule.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1mmodule.eks.data.tls_certificate.this[0]: Read complete after 0s [id=77f878887104bc97ce87a3d0fe39312e6535df5b][0m
[0m[1mmodule.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/E3FB4869220CB13E67821E7300EDAF11][0m
[0m[1mdata.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_role: Read complete after 0s [id=508740202][0m
[0m[1mmodule.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-lab-cluster:coredns][0m
[0m[1mmodule.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-lab-cluster:vpc-cni][0m
[0m[1mmodule.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-lab-cluster:kube-proxy][0m
[0m[1maws_eks_access_entry.root_user: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:root][0m
[0m[1maws_eks_access_entry.eks_deployer_user: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-eks-deployer][0m
[0m[1maws_eks_access_policy_association.root_user_admin: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1maws_eks_access_policy_association.eks_deployer_user_admin: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:user/eks-lab-eks-deployer#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_iam_policy.external_dns_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "external_dns_policy" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "ExternalDnsPolicy"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = "route53:ChangeResourceRecordSets"
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:route53:::hostedzone/*"
                      [32m+[0m[0m Sid      = "ChangeRecordsInZones"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "route53:ListTagsForResource",
                          [32m+[0m[0m "route53:ListResourceRecordSets",
                          [32m+[0m[0m "route53:ListHostedZonesByVPC",
                          [32m+[0m[0m "route53:ListHostedZonesByName",
                          [32m+[0m[0m "route53:ListHostedZones",
                          [32m+[0m[0m "route53:GetHostedZone",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                      [32m+[0m[0m Sid      = "ReadAllZones"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Project" = "eks-lab"
        }
    }

[1m  # aws_iam_role.external_dns[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "external_dns" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRoleWithWebIdentity"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/E3FB4869220CB13E67821E7300EDAF11:aud" = "sts.amazonaws.com"
                              [32m+[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/E3FB4869220CB13E67821E7300EDAF11:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Federated = "arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/E3FB4869220CB13E67821E7300EDAF11"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "external-dns-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Project" = "eks-lab"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.attach[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "attach" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "external-dns-role"
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m
```

*Pusher: @JohnMichaelWalker, Action: `pull_request`*